[
  {
    "feedback": "The drainage system in our area is terrible. Every time it rains, the streets are flooded, and it takes days for the water to recede. This is causing major inconvenience to residents, and there have been cases of waterborne diseases due to stagnant water. Despite repeated complaints, no action has been taken by the authorities. We urgently need a long-term solution for this issue.",
    "category": "Complaint"
  },
  {
    "feedback": "I would like to suggest that more streetlights be installed in our neighborhood. Many streets remain dark at night, making it unsafe for pedestrians and increasing the chances of accidents and crimes. A well-lit environment will help improve safety and security for everyone in the area.",
    "category": "Suggestion"
  },
  {
    "feedback": "Can you please provide information on how to apply for a new electricity connection in my area? I would like to know the documents required, the estimated time for approval, and the fees involved. Is there an online process for this, or do I need to visit the municipal office in person?",
    "category": "Inquiry"
  },
  {
    "feedback": "I really appreciate the efforts made by the municipal team in maintaining cleanliness in our locality. Over the past few months, I have seen a significant improvement in waste management, with garbage being collected on time and streets being regularly cleaned. Thank you for making our city a better place to live!",
    "category": "Compliment"
  },
  {
    "feedback": "The public transport system in our city is unreliable. Buses often do not follow their schedules, and many routes are overcrowded, making commuting a daily struggle. The authorities must take immediate action to improve the frequency and punctuality of buses to ease the difficulties faced by commuters.",
    "category": "Complaint"
  },
  {
    "feedback": "I think the city should introduce more green spaces and parks. Our community lacks proper recreational areas where people can relax, exercise, or spend time outdoors. Investing in more parks with jogging tracks, benches, and playgrounds would greatly benefit the residents, especially children and the elderly.",
    "category": "Suggestion"
  },
  {
    "feedback": "Could you please let me know the procedure for filing a complaint about illegal construction in my neighborhood? I have noticed some unauthorized structures being built, and I would like to report them. Who should I contact, and what evidence do I need to provide?",
    "category": "Inquiry"
  },
  {
    "feedback": "The newly renovated metro stations are fantastic! The design is modern, the facilities are clean, and the overall experience has improved tremendously. I appreciate the efforts made by the city authorities to upgrade the public transport infrastructure. Keep up the good work!",
    "category": "Compliment"
  },
  {
    "feedback": "Our area has been facing frequent power cuts without any prior notice. This is highly inconvenient, especially for students and people working from home. The electricity board should ensure a proper schedule for maintenance and send notifications in advance so that residents can be prepared.",
    "category": "Complaint"
  },
  {
    "feedback": "The government should introduce a city-wide waste segregation initiative. Many people are still unaware of how to properly separate dry and wet waste. Conducting awareness campaigns and providing separate bins to households would significantly improve waste management and recycling efforts.",
    "category": "Suggestion"
  },
  {
    "feedback": "I recently moved to this city and need to register my vehicle. Can you guide me on the process? What documents do I need, and where should I submit them? Also, is there an online platform to check the registration status?",
    "category": "Inquiry"
  },
  {
    "feedback": "Kudos to the police department for their quick response during emergencies. I had an issue recently and contacted them for help, and they arrived at the scene within minutes. Their professionalism and dedication are truly commendable. Thank you for keeping our city safe!",
    "category": "Compliment"
  },
  {
    "feedback": "The condition of the roads in our locality is deteriorating day by day. Potholes and cracks make driving extremely unsafe, and the risk of accidents has increased. The authorities need to conduct urgent road repairs before the monsoon season begins to prevent further damage.",
    "category": "Complaint"
  },
  {
    "feedback": "I would like to suggest implementing a digital appointment system for government offices. Currently, citizens have to wait in long queues for hours, which is highly inefficient. A simple online booking system would save time and improve the overall experience for everyone.",
    "category": "Suggestion"
  },
  {
    "feedback": "How can I check the status of my income tax refund? I filed my returns two months ago, but I haven’t received any updates. Is there an official website where I can track my refund, or do I need to visit the tax office?",
    "category": "Inquiry"
  },
  {
    "feedback": "I appreciate the recent initiatives taken to promote sustainable living in our city. The installation of solar-powered streetlights and the introduction of electric buses are excellent steps toward a greener future. I hope to see more such eco-friendly projects in the coming years!",
    "category": "Compliment"
  },
  {
    "feedback": "The noise pollution in our area has become unbearable. Late-night construction work and loudspeakers from events disturb residents, especially elderly people and students. The authorities should strictly enforce noise pollution regulations to ensure a peaceful environment for everyone.",
    "category": "Complaint"
  },
  {
    "feedback": "The local library could use some improvements. Adding more books, especially in regional languages, would make it more accessible to a wider audience. Additionally, extending the working hours would benefit students and working professionals who want to use the facility in the evenings.",
    "category": "Suggestion"
  },
  {
    "feedback": "Where can I apply for a senior citizen discount on public transport? I have heard about this scheme, but I am not sure how to avail it. What documents are required, and is there an online application process available?",
    "category": "Inquiry"
  },
  {
    "feedback": "The recent efforts in tree plantation across the city are truly commendable! It’s heartening to see more greenery in urban areas, and I hope the authorities continue such initiatives. More trees mean better air quality and a healthier environment for all.",
    "category": "Compliment"
  }
]
